SET FOREIGN_KEY_CHECKS=0;
LOCK TABLES `_of_sso_func` WRITE, `_of_sso_pack` WRITE, `_of_sso_permit` WRITE, `_of_sso_realm` WRITE, `_of_sso_role` WRITE, `_of_sso_user` WRITE;
REPLACE INTO `_of_sso_func` (`id`,`realmId`,`name`,`state`,`lable`,`data`) VALUES ('1','1','userAdd','1','用户添加',''),
('2','1','userMod','1','用户修改',''),
('3','1','userDel','1','用户删除',''),
('4','1','userIce','1','用户停用',''),
('5','1','userPack','1','用户角色',''),
('6','1','realmAdd','1','系统添加',''),
('7','1','realmMod','1','系统修改',''),
('8','1','realmDel','1','系统删除',''),
('9','1','realmIce','1','系统停用',''),
('10','1','packAdd','1','角色添加',''),
('11','1','packMod','1','角色修改',''),
('12','1','packDel','1','角色删除',''),
('13','1','packIce','1','角色停用',''),
('14','1','packFunc','1','角色权限',''),
('15','1','funcAdd','1','权限添加',''),
('16','1','funcMod','1','权限修改',''),
('17','1','funcDel','1','权限删除',''),
('18','1','funcIce','1','权限停用','');
REPLACE INTO `_of_sso_pack` (`id`,`realmId`,`name`,`state`,`lable`,`data`) VALUES ('1','1','admin','1','管理员','');
REPLACE INTO `_of_sso_permit` (`id`,`realmId`,`packId`,`userId`) VALUES ('1','1','1','1');
REPLACE INTO `_of_sso_realm` (`id`,`name`,`pwd`,`state`,`lable`,`notes`,`trust`) VALUES ('1','sso','123456','1','单点登陆系统','单点登陆系统','1');
REPLACE INTO `_of_sso_role` (`id`,`realmId`,`packId`,`funcId`) VALUES ('1','1','1','1'),
('2','1','1','2'),
('3','1','1','3'),
('4','1','1','4'),
('5','1','1','5'),
('6','1','1','6'),
('7','1','1','7'),
('8','1','1','8'),
('9','1','1','9'),
('10','1','1','10'),
('11','1','1','11'),
('12','1','1','12'),
('13','1','1','13'),
('14','1','1','14'),
('15','1','1','15'),
('16','1','1','16'),
('17','1','1','17'),
('18','1','1','18');
REPLACE INTO `_of_sso_user` (`id`,`name`,`pwd`,`nike`,`state`,`notes`,`find`) VALUES ('1','admin','e10adc3949ba59abbe56e057f20f883e','系统管理员','1','','\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0\0');
UNLOCK TABLES;
SET FOREIGN_KEY_CHECKS=1;
